package com.example.love_shayari;

import android.annotation.SuppressLint;
import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

public class Listview_secondpage extends AppCompatActivity {

    int imgarr1[] = {R.drawable.bewfa,R.drawable.god,R.drawable.holiimg,R.drawable.husband,R.drawable.kanjoos,
            R.drawable.love,R.drawable.loveshayari,R.drawable.married,R.drawable.officework,R.drawable.politics};

    String bewfa[] = {"तेरा ख्याल दिल से मिटाया नहीं अभी,\n" +
                        "बेवफा मैंने तुझको भुलाया नहीं अभी..!!",
                        "तेरी बेवफाई का गम तो नहीं,\n" +
                        "मगर तू बेवफा है,\n" +
                        "दुःख ये भी काम नहीं।।",
                        "नाजुक लगते थे जो हसीन लोग,\n" +
                        "वास्ता पड़ा तो पत्थर के निकले।।",
                        "इस मतलबी दुनिया में\n" +
                        "इश्क़ सिर्फ दिखावा है,\n" +
                        "तुझे भी धोखा मिलेगा ये मेरा दावा है !!",
                        "आँखों में आँसू आ गए\n" +
                        "ये सोच कर,\n" +
                        "दुनिया तो बेवफा थी\n" +
                        "पर उसको क्या हुआ।।",
                        "अनदेखी का शोख था,\n" +
                        "हमने भी उनका तोहफा\n" +
                        "उन्ही को वापस कर दिया।",
                        "रो पड़ा है आसमा भी मेरी वफ़ा को\n" +
                        "देख कर देख तेरी बेवफाई की बात\n" +
                        "बादलों तक जा पहुंची।।",
                        "कभी मिले फुर्सत तो\n" +
                        "इतना जरूर बताना,\n" +
                        "वो कौन सी मोहब्बत थी\n" +
                        "जो हम तुम्हे ना दे सके।।",
                        "दिल की बात तो हर कोई करता है,\n" +
                        "लेकिन मरते सब चेहरों पर ही है।",
                        "कहीं जीत तो कहीं हार के निशान हैं,\n" +
                        "कौन जाने, हम कितने दिन के मेहमान हैं।"};

    String god[] = {"तुझसे मांगी हर दुआ एक ख्वाब बना है\n" +
                    "ए खुदा तेरी रहमतो से ही मैं इंसान बना है.!!",
                    "दुख ईश्वर का बनाया हुआ ऐसा चक्र है\n" +
                    "जिसमें आपकी\n" +
                    "काबिलियत को परखा जाता है.!!",
                    "गीता में लिखा है कि\n" +
                    "असत्य के आगे कभी झुकना नही\n" +
                    "और हार कर कभी रुकना नही.!!",
                    "खुद से भी बढ़कर तुझे माना है\n" +
                    "तेरे चमत्कारो से हमने\n" +
                    "जिंदगी को जाना है..!",
                    "एक अमल ने मुझे\n" +
                    "गुनाहों से बचा रखा है\n" +
                    "मेरी भक्ति ने मुझे\n" +
                    "रब से मिला रखा है..!",
                    "मंदिर, मस्जिद, गुरुद्वारे\n" +
                    "छान लिए सारे के सारे\n" +
                    "खुद को छोड़ आ\n" +
                    "गया भगवान के द्वारे..!",
                    "जिस इंसान का दिल साफ होता है\n" +
                    "उसी के दिल में रब का वास होता है..!",
                    "जो मनुष्य सत्य के साथ चलता है\n" +
                    "वही जिंदगी के कुरुक्षेत्र में जीतता है..!",
                    "जो ईश्वर ने करा उस पर सवाल कैसा\n" +
                    "सब बेहतर ही होगा तो बवाल कैसा..!",
                    "मैं भुला दूं कैसे रब तुझे तू मेरी बातों में है\n" +
                    "मैं मिटा दूंगा कैसे तुझे तू मेरी सांसो में है..!"};

    String holi[] = {"सिर्फ प्यार का नहीं इस बार, ज़रा दुआओं का रंग भी लगाना। - Happy Holi",
                     "मेहनत के रंग से तू अपने सपनों में नया रंग भर दे। - होली की हार्दिक शुभकामनाएं",
                     "कुछ लोगों की मेहनत को देख के लगता है की, इन पर कुछ नया करने का रंग चढ़ा है I ",
                     "इस होली आप भी अपनी ज़िंदगी में नया रंग भरें।",
                     "इस होली रंग दो दिलों के ज़ख्मों को, प्यार के मरहम से। - होली की हार्दिक शुभकामनाएं",
                     "प्यार के रंगों से भरो पिचकारी, स्नेह के रंगों से रंग दो दुनिया सारी। - होली की हार्दिक शुभकामनाएं",
                     "रंगों से मत डरिये, क्योंकि रंग, रंग नहीं बदलते।",
                     "रंगीन दुनिया हो और मौसम सुहाना, तुम्हें हर खुशी मिले जिससे हो तुम्हारा तानाबाना।",
                     "गिले शिकवे भुला कर खुशियां मनाओ सभी, चलो होली आ गई दिल से दिल मिलाओ सभी।",
                     "होली देखो आई है रंग हज़ार लाई है, संग में अपने खुशीयों की सौगात लेके आई है।"};

    String husband[] = {"जैसे तारों के बिना आसमान अधूरा\n" +
                        "हमारे ज़िन्दगी का सफर आपके बिना नहीं है पूरा।",
                        "बड़ा ही मीठा नशा है उनकी हर बात में\n" +
                        "हर वक़्त बस उन्हें सुनने का ही मन करता है",
                        "कितना करीब से जाना तुमने मुझे\n" +
                        "ऐसा लगता है मानों परछाई हो तुम मेरी",
                        "इतने लड़ते झगड़ते बीते वक्त हमारा कि\n" +
                        "हम रह ना पाए एक-दूसरे को देखें बगैर",
                        "सवाल बहुत थे पहले अपने दिल से\n" +
                        "तुम जवाब बन के ही आ गए ।।",
                        "साथ देना मेरा तुम हर एक मोड़ पर\n" +
                        "तुम्हारे बिन मेरा सब कुछ अधूरा है",
                        "अंदाज बदल जाते हैं ,\n" +
                        "आंखों में शरारत सी रहती है\n" +
                        "चेहरे से पता चल जाता है\n" +
                        "जिस दिल में मोहब्बत रहती है",
                        "तड़प के देखो किसी की चाहत में,\n" +
                        "तो पता चलेगा कि इंतजार क्या होता है..\n" +
                        "यूं ही मिल जाए कोई बिना चाहे,\n" +
                        "तो कैसे पता चलेगा, कि प्यार क्या होता है.",
                        "मेरी चाहतें तुमसे अलग कहाँ हैं,\n" +
                        "दिल की बाते तुमसे छुपी कहाँ हैं,\n" +
                        "तुम साथ रहो दिल में धड़कन की जगह,\n" +
                        "फिर जिन्दगी को साँसों की जरूरत कहाँ हैं.",
                        "जाती नही आँखों से सूरत आपकी,\n" +
                        "जाती नही दिल से मोहब्बत आपकी,\n" +
                        "महसूस ये होता हैं जीने के लिए\n" +
                        "पहले से ज्यादा जरूरत हैं आपकी"};

    String kanjoos[] = {"कुछ इस कदर वो कंजूस है,\n" +
                        "अकेले में पीता वो जूस है.",
                        "जो पैसे बचाता है कंजूसी कर,\n" +
                        "उसे दुखो का तू हिसाब न कर,",
                        "कंजूसी करके भी कुछ नहीं पाना है,\n" +
                        "ऐ दोस्त, सब कुछ यही छोड़ जाना हैं.",
                        "दोस्तों की कंजूसी इस तरह बढ़ रही है,\n" +
                        "जैसे महँगाई किसी गरीब से लड़ रही है.",
                        "मोहब्बत में उसने कुछ इस कदर कंजूसी की,\n" +
                        "मैंने पूरा वक्त दिया और उसने वक्त बचा ली.",
                        "किसी से इश्क करके कंजूसी न करना,\n" +
                        "लुटाने से बढ़ता है ये दौलत बेसुमार।",
                        "जो खर्च न करे, उसे कंजूस कहते है लोग\n" +
                        "इसके पीछे छिपी मजबूरियाँ कहाँ देखते है लोग.",
                        "उधर आप मजबूर बैठे है,\n" +
                        "इधर हम खामोश बैठे है,\n" +
                        "बात हो तो कैसे हो,\n" +
                        "जब दोनों तरफ कंजूस बैठे है.",
                        "वो सोचते है मैं कंजूस क्यों हूँ,\n" +
                        "जब वो गरीबी से गुजरेंगे,\n" +
                        "बड़ी मुश्किल से पैसे कमाएंगे,\n" +
                        "मैं कंजूस क्यों हूँ तो समझ पायेंगे.",
                        "माना कि कंजूस पैसे बचाता है,\n" +
                        "उन पैसों को देखकर वो खुश हो जाता है,\n" +
                        "सबका अपना-अपना जीने का तरीका है\n" +
                        "सब कुछ लुटाकर भी कोई खुश नहीं हो पाता है.",};

    String love[] = {"है इश्क तो फिर असर भी होगा,\n" +
                     "जितना है इधर उधर भी होगा ।",
                     "मिल नहीं पाता तो क्या हुआ,\n" +
                     "मोहब्बत तो तुमसे फिर भी बेहिसाब करता हूं ।",
                     "जिसे सोच कर ही चहरे पर खुशी आ जाये,\n" +
                     "वो खूबसूरत एहसास हो तुम ।",
                     "तेरे इश्क में में इस तरह नीलाम हो जाऊँ,\n" +
                     "आखरी हो तेरी बोली और में तेरे नाम हो जाऊ ।",
                     "मुझे बस तू चाहिये,\n" +
                     "ये मत पूछ क्यों चाहिए !",
                     "तुम्हें दिल में हजार बार याद करता हूँ,\n" +
                     "मैं तुम्हें तुमसे ज्यादा प्यार करता हूँ ।",
                     "दूरियों से ही एहसास होता है की,\n" +
                     "नज्दिकिया कितनी खास होती हैं ।",
                     "कहने को तो मेरा दिल एक है लेकिन,\n" +
                     "जिसको दिल दिया है वो हजारो में एक है।",
                     "मेरी जिन्दगी मेरी जान हो तुम,\n" +
                     "मेरी सुकून का दूसरा नाम हो तुम ।",
                     "आप की खा़तिर अगर हम लूट भी लें आसमाँ,\n" +
                     "क्या मिलेगा चंद चमकीले से शीशे तोड़ के !"};

    String lovesyari[] = {"रोते-रोते थककर जैसे कोई बच्चा सो जाता है\n" +
                          "हाल हमारे दिल का अक्सर कुछ ऐसा ही हो जाता है",
                          "ये जो हालात है, यकीनन एक दिन सुधर जाएंगे,\n" +
                          "पर अफसोस के कुछ लोग दिल से उतर जाएंगे",
                          "पास जब तक वो रहे दर्द थमा रहता है,\n" +
                          "फैलता जाता है फिर आँख के काजल की तरह।",
                          "मोहब्बत ख़ूबसूरत होगी किसी और दुनिया में,\n" +
                          "इधर तो हम पर जो गुज़री है हम ही जानते हैं।",
                          "अजीब सी थी वो, \n" +
                          "मुझे बदल कर खुद बदल गई",
                          "ज़ख्म दे कर ना पूछ तू मेरे दर्द की शिद्दत,\n" +
                          "दर्द तो फिर दर्द है कम क्या ज्यादा क्या।",
                          "लोग कहते है हर दर्द की एक हद होती है,\n" +
                          "शायद उन्होंने मेरा हदों से गुजरना नहीं देखा।",
                          "कौन तोलेगा हीरों में अब तुम्हारे आंसू फ़राज़,\n" +
                          "वो जो एक दर्द का ताजिर था दुकां छोड़ गया।",
                          "जितना बदल सकते थे बदल लिया खुद को..!\n" +
                          "अब जिसको शिकायत हो वो अपना रास्ता बदल ले",
                          "कितने अजीब है जमाने के लोग\n" +
                          "खिलौना छोड़ कर जज्बातों से खेलते है"};

    String married[] = {"इश्क तो दिल देखकर होता है,\n" +
                        "चेहरे देखकर तो शादियाँ होती हैं।",
                        "एक अरसे के बाद आज मेरे उस सवाल का जवाब आया,\n" +
                        "बिना बोले उसने मेरे हाथों में अपनी शादी का कार्ड थमाया।",
                        "जिंदगी की खुशियां आधी कर ले,\n" +
                        "चलो न अब हम दोनो शादी कर ले।",
                        "अपनी खुशी दे कर फिर तुझसे जुड़ जाऊँगा,\n" +
                        "ये शादी की रश्में पूरी कर संग सात जन्म बिताऊंगा।",
                        "उनके इश्क़ की तरक्की हो गयी,\n" +
                        "जब उनकी शादी पक्की हो गयी।",
                        "अपनी आज़ादी को हम हरगिज़ मिटा सकते नहीं,\n" +
                        "हो गयी शादी तो अब हम गीत ये गा सकते नहीं।",
                        "कब तक तुम मनाओगे जश्न यूँ ही आजादी का,\n" +
                        "अब जल्द ही भिजवा दो कार्ड अपनी शादी का।",
                        "मोहब्बत भी हमें कब तक रुलाएगी,\n" +
                        "एक दिन हमारी भी शादी हो जायेगी।",
                        "अब मैं थक चुका हूं मोहब्बत के झमेले से,\n" +
                        "हे ऊपर वाले मेरी भी शादी करा दे किसी चम्पा-चमेली से।",
                        "शादी के बाद लड़कियां तो सिर्फ घर छोड़ती है,\n" +
                        "पराए तो अकसर लड़के हो जाते है शादी के बाद।"};

    String officework[] = {"कौन है जिसे कमी नहीं है,\n" +
                           "आसमान के पास भी जमीन नहीं है !",
                           "अक्सर अंधेरों से भरी गलियों में,\n" +
                           "नजर आई रोशनियां आंखों को चुभा करती हैं !",
                           "कुछ सीख लो फूलों से,\n" +
                           "खुद महकना ही नहीं गुलशन को महकाना भी है !",
                           "सही को सही और गलत को गलत कहता हूँ,\n" +
                           "इसीलिए शायद रिश्ते कम रखता हूँ !",
                           "मुश्किलों से कह दो की उलझे ना हम से,\n" +
                           "हमे हर हालात मैं जीने का हूनर आता है !",
                           "हाल मीठे फलों का मत पूछिए साहब,\n" +
                           "रात दिन चाकू की नोंक पे रहते है !",
                           "अच्छा हैं की जानवर कुछ बोलते नहीं,\n" +
                           "अगर बोलते तो इंसानियत शर्मशार हो जाती !",
                           "यूँ शक ना किया करो मेरी दोस्ती पे,\n" +
                           "तुम्हारे बिना भी हम तुम्हारे ही रहते है !",
                           "जब तक मन में खोट और दिल में पाप है !\n" +
                           "तब तक बेकार सारे मंत्र और जाप है !",
                           "ना होती मोहब्बत तो कैसे जान पाते,\n" +
                           "कैसे जीते हैं लोग किसी पर मरने के बाद !"};

    String politics[] = {"सरकार को गरीबों का ख्याल\n" +
                         "कब आता है चुनाव नजदीक आ जाए तो\n" +
                         "मुद्दा उछाला जाता है !!",
                         "जिनको हम चुनते हैं वो ही हमें धुनते हैं\n" +
                         "चाहे बीवी हो या नेता दोनों कहाँ सुनते हैं !!",
                         "इस बात से सलाम करना मेरी सूरत\n" +
                         "का अंदाजा वह लोग लगाते हें जो मुझे\n" +
                         "सलाम टोकते हैं जिन्हें तू सलाम करता है !",
                         "सरहदों पर बहुत तनाव है क्या\n" +
                         "कुछ पता करो चुनाव है क्या !!",
                         "दुनिया कहती हैं तेरी दोस्ती\n" +
                         "कम क्यों हैं लेकिन वह नहीं जानते कि\n" +
                         "मेरे दोस्त सारे किंग है !!",
                         "जो तौर है दुनिया का उसी तौर से बोलो\n" +
                         "बहरों का इलाका है ज़रा ज़ोर से बोलो !!",
                         "चुनावों में दुनिया को देखो मुस्कुराती\n" +
                         "और खुशिया बनाती नजर आएगी !",
                         "जहाँ सच हैं वहाँ पर हम खड़े हैं\n" +
                         "इसी खातिर आँखों में गड़े हैं !!",
                         "ऐसा कोई ईलाका नही जहां अपना कहर\n" +
                         "नहीं ऐसी कोई मोहल्ला नही\n" +
                         "जहां अपनी चली नही !!",
                         "नेता की बातों में सच्चाई का\n" +
                         "अभाव होता है\n" +
                         "झूठ बोलना तो इनका\n" +
                         "स्वभाव होता हैं !!"};
    ListView listview;
    MyAdapter_secondpage newAdapter;

    String list[];
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_listview_secondpage);
        listview = findViewById(R.id.listview2);


        int position = getIntent().getIntExtra("pos",0);
        if(position==0){
            list = bewfa;
        }
        else if(position==1){
            list = god;
        }
        else if(position==2){
            list = holi;
        }
        else if(position==3){
            list = husband;
        }
        else if(position==4){
            list = kanjoos;
        }
        else if(position==5){
            list = love;
        }
        else if(position==6){
            list = lovesyari;
        }
        else if(position==7){
            list = married;
        }
        else if(position==8){
            list = officework;
        }
        else if(position==9){
            list = politics;
        }

        newAdapter = new MyAdapter_secondpage(Listview_secondpage.this,imgarr1[position],list);
        listview.setAdapter(newAdapter);

        listview.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int i, long l) {
                Intent intent = new Intent(Listview_secondpage.this,Shayari_Thirdpage.class);
                intent.putExtra("pos",i);
                intent.putExtra("shayari",list);
                startActivity(intent);
            }
        });
    }
}